Dlubal.RFEM5.LoadType
Type of load.

Dlubal.RFEM5.LoadType.UnknownLoadType
Unknown load type

Dlubal.RFEM5.LoadType.ForceType
Force

Dlubal.RFEM5.LoadType.MomentType
Moment

Dlubal.RFEM5.LoadType.TemperatureType
Uniform temperature

Dlubal.RFEM5.LoadType.AxialStrainType
Axial strain

Dlubal.RFEM5.LoadType.AxialDisplacementType
Axial displacement

Dlubal.RFEM5.LoadType.PrecamberType
Precamber

Dlubal.RFEM5.LoadType.InitialPrestressType
Initial prestress

Dlubal.RFEM5.LoadType.EndPrestressType
End prestress

Dlubal.RFEM5.LoadType.DisplacementType
Displacement

Dlubal.RFEM5.LoadType.RotationLoadType
Rotation

Dlubal.RFEM5.LoadType.FullPipeContentType
Full pipe content

Dlubal.RFEM5.LoadType.PartialPipeContentType
Partial pipe content

Dlubal.RFEM5.LoadType.PipeInternalPressureType
Pipe internal pressure

Dlubal.RFEM5.LoadType.RotaryMotionType
RotaryMotion

Dlubal.RFEM5.LoadType.BuoyancyType
Buoyancy